[
  {
    "role" : "Co-Founder",
    "company" : "EUDPR (European Union Data Protection Representatives)",
    "period" : "Dec 2018 – Present",
    "location" : "Paris Area, France",
    "companyDescription" : "Settled outside the European Union, our customers come from a wide range of industries, such as marketing companies, content providers or staffing solutions, however the list is not exhaustive.<br>They have in common the processing of personal data from EU residents, with the noteworthy exception they do not deal with sensitive data as defined by Article 9 of GDPR. In other words, our customers do not collect records of criminal convictions, or ethnicity, religious or philosophical beliefs, political opinions, trade union membership details, health, sex life, or sexual orientation data on a large scale.",
    "roleDescription" : "",
    "tasks"  : []
  },
  {
    "role" : "Country Manager",
    "company" : "BICRA",
    "period" : "September 2018",
    "location" : "Montreal, Canada/New York, USA",
    "companyDescription" : "Founded in 2018 by privacy regulation professionals, Blockchain Industry Compliance and Regulation Association (BICRA) is a non-profit created to fill the gap between the worlds of blockchain and regulation. By forming a community of blockchain professionals, BICRA aims to ensure that members are in compliance with regulations all over the world through transparency and integrity. BICRA hopes to recognize those who are encompassing our values.",
    "roleDescription" : "",
    "tasks"  : []
  },
  {
    "role" : "IT Project Manager",
    "company" : "Clears",
    "period" : "March 2018 &ndash; September 2018",
    "location" : "Montreal, Canada",
    "companyDescription" : "CLEARS is a financial clearing company with offices based in New-York, Montreal and Hong-Kong.",
    "roleDescription" : "The product manager is in charge to coordinate the Montreal office squaretup, managing the different projects.",
    "tasks"  : [
      "Management and control of the delivery of multiple concurrent projects of all sizes with strict deadlines and quality requirements",
      "Delivers strategies which maximise project revenues, minimise costs, and ensure customer satisfaction",
      "Management of the full project life-cycle from beginning to end",
      "Determining the scope, deliverables and acceptance criteria for project",
      "Working with developers, managers and other office&rsquo;s project manager to ensure every deliverables and deadlines are met in time.",
      "Supervise and motivate resources involved in project deliveries in a matrix-management structure to ensure quality and consistency",
      "Managing expectations of customer and company stakeholders",
      "Delegation of tasks and responsibilities to appropriate personnel",
      "Resolution of issues and conflicts within projects",
      "Delivery of progress reports, proposals, requirements documentation, and presentations"
    ]
  },
  {
    "role" : "IT Project Manager Junior",
    "company" : "Nuance Communications",
    "period" : "January 2017 &ndash; April 2017",
    "location" : "Montreal, Canada",
    "companyDescription" : "Internship within the Project Management Team of the Engineering Group, collaborating with the group's project managers as well as the development, quality assurance, and research teams. Participating in the most complex client project of the Nuance Cloud Services team with the role to actively support the main project manager assigned to the project.",
    "roleDescription" : "",
    "tasks"  : [
      "Monitor the progress of tasks and objectives.",
      "Participate in discussions and user story planning.",
      "Work with different teams to update user stories.",
      "Produce progress reports and update risks.",
      "Reflect and propose improvements to working methods."
    ]
  },
  {
    "role" : "IT Project Manager",
    "company" : "LC Social Status Inc.",
    "period" : "June 2016 &ndash; December 2016",
    "location" : "Montreal, Canada",
    "companyDescription" : "Development of web projects, growth monitoring traffic on the website, information management on social networks. Building business plan and sales strategy development along with technical documentations.",
    "roleDescription" : "",
    "tasks"  : []
  },
  {
    "role" : "Volunteering",
    "company" : "Evangel Pentecostal Church",
    "period" : "2016 May",
    "location" : "Montreal, Canada",
    "companyDescription" : "",
    "roleDescription" : "Management of 10+ custodians and security guards at 2016&rsquo;s Paradox Conference",
    "tasks"  : []
  },
  {
    "role" : "IT Project Manager",
    "company" : "Olton Marketing Inc.",
    "period" : "February 2016 &ndash; june 2016",
    "location" : "Montreal, Canada",
    "companyDescription" : "Development of web projects, management of international outsourced workers. Building business plan and sales strategy development along with technical documentations.",
    "roleDescription" : "",
    "tasks"  : []
  },
  {
    "role" : "Volunteering for Church events",
    "company" : "Evangel Pentecostal Church",
    "period" : "April 2015 &ndash; November 2015",
    "location" : "Montreal, Canada",
    "companyDescription" : "",
    "roleDescription" : "",
    "tasks"  : [
      "Custodian and security guard at Evangel&rsquo;s marriage conference",
      "Custodian and security guard at the PAOC church planting conference",
      "Chef cook for 50+ mens at church men&rsquo;s up conference "
    ]
  },
  {
    "role" : "Assistant Operation Manager Volunteer",
    "company" : "Evangel Pentecostal Church",
    "period" : "April 2015 &ndash; October 2015",
    "location" : "Montreal, Canada",
    "companyDescription" : "",
    "roleDescription" : "Helping operation manager in purchasing of supplies, sharing my expertise during meetings with stakeholders and consulting of companies for the renovation of the church.",
    "tasks"  : []
  },
  {
    "role" : "Assistant Project Manager",
    "company" : "Mott MacDonald Ltd Canada",
    "period" : "January 2015 &ndash; April 2015",
    "location" : "Montreal, Canada",
    "companyDescription" : "",
    "roleDescription" : "Management and delivery of independent Certifier services on PPP project, bringing an analysis and an external opinion in disagreement between the Parties, shall prepare and issue monthly certificates and reports, performs audits and analyzes the qualities of work on advancements site.",
    "tasks"  : []
  },
  {
    "role" : "Project Manager",
    "company" : "Bouygues Construction Priv&eacute;e",
    "period" : "January 2013 &ndash; April 2014",
    "location" : "Paris, France",
    "companyDescription" : "",
    "roleDescription" : "Construction of an art building, site access of a bank headquarter, team of 10 laborers and 2 engineering offices.",
    "tasks"  : [
      "Planning and organizing work of the laborers to build the basement in precast concrete",
      "Provide feedback on the yield of workers",
      "Determination, evaluation and risks management while striving to reach objectives"
    ]
  },
  {
    "role" : "Project Manager",
    "company" : "Vinci Construction (GTM B&acirc;timent)",
    "period" : "May 2008 &ndash; April 2012",
    "location" : "Paris, France",
    "companyDescription" : "",
    "roleDescription" : "District renovation project, regulated all facets of the project, team of 6 foremen and 10 subcontractors.",
    "tasks"  : [
      "Monitors and manages site staffing levels to ensure foremen development and talent acquisition to achieve and maintain project operational requirements",
      "Estimate project costs and seek financial alternatives",
      "Manage progress, deadlines and budgets of project",
      "Conduct change depending on the cost and the schedule as needed",
      "Manage $6 million project phase budget",
      "Manage with integrity, honesty and knowledge that promote the culture, values and mission of the company",
      "Planning and organizing work of the laborers to realize in order to reach objectives"
    ]
  }
]
